# Pandas Practice — Part 3 (Questions 41–60)

In [ ]:

import pandas as pd
import numpy as np

# Create a demo DataFrame
df = pd.DataFrame({
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[23,35,45,29],
    'City':['New York','Paris','London','Tokyo']
}, index=['row1','row2','row3','row4'])

df

### Q41: Add a new column 'Salary' with value 50000.

In [ ]:
df['Salary'] = 50000; df

### Q42: Create column 'Age_in_Months' = Age*12.

In [ ]:
df['Age_in_Months'] = df['Age']*12; df

### Q43: Update Salary of row1 to 60000.

In [ ]:
df.loc['row1','Salary'] = 60000; df

### Q44: Set first row values to 0.

In [ ]:
df.iloc[0,:] = 0; df

### Q45: Drop column 'Salary'.

In [ ]:
df2 = df.drop(columns=['Salary']); df2

### Q46: Drop multiple columns ['Age_in_Months','City'].

In [ ]:
df3 = df.drop(columns=['Age_in_Months','City']); df3

### Q47: Drop row 'row2'.

In [ ]:
df4 = df.drop(index='row2'); df4

### Q48: Drop first row using index position.

In [ ]:
df5 = df.drop(df.index[0]); df5

### Q49: Remove duplicate rows.

In [ ]:
df6 = df.drop_duplicates(); df6

### Q50: Rename column 'Name' to 'Full_Name'.

In [ ]:
df7 = df.rename(columns={'Name':'Full_Name'}); df7

### Q51: Rename multiple columns.

In [ ]:
df8 = df.rename(columns={'Age':'Years','City':'Location'}); df8

### Q52: Increase Age by 1 using apply.

In [ ]:
df['Age'] = df['Age'].apply(lambda x: x+1); df

### Q53: Replace 'New York' with 'NYC' in City.

In [ ]:
df['City'] = df['City'].replace('New York','NYC'); df

### Q54: Convert Salary column to int.

In [ ]:
df['Salary'] = df['Salary'].astype(int); df.dtypes

### Q55: Update Salary of rows 1 to 3 to 75000.

In [ ]:
df.loc['row1':'row3','Salary'] = 75000; df

### Q56: Get 3 random rows.

In [ ]:
df.sample(3)

### Q57: Add a boolean column 'Is_Employee'=True.

In [ ]:
df['Is_Employee'] = True; df

### Q58: Halve Age values.

In [ ]:
df['Age'] = df['Age']/2; df

### Q59: Create 'Full_Name' = First_Name + Last_Name.

In [ ]:
demo = pd.DataFrame({'First_Name':['Tom','Jane'], 'Last_Name':['Lee','Doe']}); demo['Full_Name']=demo['First_Name']+' '+demo['Last_Name']; demo

### Q60: Reset index to default integers.

In [ ]:
df_reset = df.reset_index(drop=True); df_reset